# encoding=utf-8

a = ['a', 'b', 'c', 'd']
# 列表元素下标是从0开始的，-1的下标是从右到左的
print(a[0], a[-1])    #结果为 a d

# 去列表的第1个到第3个元素，但不包含第3个元素[1,3)
print(a[1:3])     #结果为 ['b', 'c']

# 冒号之前不写，默认是从左边的第0个元素开始[0,3)
print(a[:3])   #结果为 ['a', 'b', 'c']

# 设置了步长为-1，则表示是从右到左，
# 而第一个冒号后面没写，则表示是从右边的第0个元素开始
# 而第二个冒号后面没写，则表示从右到左的左边最后一个元素
print(a[::-1])    #结果为 ['d', 'c', 'b', 'a']

# 从左向右，步长为2
print(a[::2])     #结果为 ['a', 'c']

b = 'book'
# 字符串下标是从0开始的，-1的下标是从右到左的
print(b[0], b[-1])  #结果为 b k
print(b[::-1])      #结果为 koob


c = ['a', 100, 101, 'c']
#得到列表的长度
print(len(c))  #结果为4
print(c*2)     #结果为['a', 100, 101, 'c', 'a', 100, 101, 'c']   

# 合并列表
d = ['e', 'f', 'g']
print(c + d)     #结果为['a', 100, 101, 'c', 'e', 'f', 'g']

d1 = [1,2]
print(d.extend(d1)) #结果为

# 判断元素是否在列表中
if  'e' in d:
    print('True')
else:
    print('False')


# 向列表中增加元素
e = [1,2,3,4]
e.append(500)     
print(e)         #结果为[1, 2, 3, 4, 500]

# 在1号位置之前插入元素100
e.insert(1,100)
print(e)         #结果为[1, 100, 2, 3, 4, 500]

# 在列表中移除删除指定索引位置的元素,默认是删除最后一个元素，并返回被删除的元素值
e1 = e.pop(1)
e1 = e.pop()
print(e1, e) 

# 在列表中移除指定元素    
e.remove(3)      
print(e)         #结果为[1, 2, 4, 500]

# 清空列表
e.clear()

# 列表排序
f = [1,100,2,3,56,98]
f.sort()              # 默认从小到大排序
print(f)
f.sort(reverse=True)  # 从大到小排序
print(f)

# 反序
g = ['a', 1, 3, 'd', 'b', 4]
g.reverse()
print(g)

# 将字符串转换成列表
h = 'hello world'
i = list(h)         #结果为 ['h', 'e', 'l', 'l', 'o', ' ', 'w', 'o', 'r', 'l', 'd']
print(i)       

# 将列表转换成字符串
print("".join(i))   #结果为hello world